---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCImportIntent
source: html/07dbaa65-98da-4403-7c19-c234246584ba.htm
---
# Autodesk.Revit.DB.IFC.IFCImportIntent

The intent of the IFC import.

## Syntax (C#)
```csharp
public enum IFCImportIntent
```